Documents/ВыдачаСИЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВыдачаСИЗ</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказНаВыдачуСИЗ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ВыдачиСИЗПоНоменклатуре</xr:Item>
				<xr:Item>AccumulationRegister.СформированныеЗаказыНаВыдачуСИЗ</xr:Item>
				<xr:Item>AccumulationRegister.ВыданныеСИЗ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>// АПК:58 Краткий перечень сотрудников, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РабочиеМеста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиРабочегоМеста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НоменклатураСИЗ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиРабочегоМеста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СИЗ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СредстваИндивидуальнойЗащиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>АПК:58</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатВыдачи</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РезультатыВыдачиСИЗ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособВыдачи</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыВыдачиСИЗ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дежурное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КратностьВыдачи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодичностьВыдачи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаПериодичностиВыдачи</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Размеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоследняяВыдача</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОснованиеВыдачи</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОснованиеВыдачиСИЗ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействиеСРанееВыданнымСИЗ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДействияСИстекающимиСИЗ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СпособыВыдачиСИЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыВыдачиСИЗ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПериодичностью</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоИзноса</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СредстваИндивидуальнойЗащиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СредстваИндивидуальнойЗащиты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьВыдачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьВыдачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаПериодичностиВыдачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПериодичностиВыдачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеХарактеристик</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыИспользованияХарактеристикНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВыдачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВыдачиСИЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецХарактеристик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ВыдачаСИЗ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок( ЗначениеРазрешено(ФизическиеЛица.ФизическоеЛицо, NULL КАК ИСТИНА)
	|	) И ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОхранаТрудаКлиентСервер.ЗаполнитьПредставлениеДокумента(Данные, Представление, НСтр("ru = 'Выдача СИЗ'"));
	
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Документы.ПродлениеСроковНоскиСИЗ.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.СписаниеСИЗИзЭксплуатации.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	КомандаСоздатьНаОсновании = СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Документы.ВыдачаСИЗ);
	Если КомандаСоздатьНаОсновании <> Неопределено Тогда
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
	КонецЕсли;
	
	Возврат КомандаСоздатьНаОсновании;
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки, , "ОхранаТруда");
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
КонецПроцедуры

#КонецОбласти

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.ВыдачаСИЗ;
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаПоМетаданнымФизическиеЛицаВТабличныхЧастях(МетаданныеДокумента);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.ВыдачаСИЗ";
	КомандаПечати.Идентификатор = "ПФ_MXL_ВедомостьУчетаВыдачиСИЗ";
	КомандаПечати.Представление = НСтр("ru = 'Ведомость учета выдачи СИЗ'");
	КомандаПечати.Порядок = 10;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

// Формирует печатные формы
//
// Параметры:
//  (входные)
//    МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//    ПараметрыПечати - Структура - дополнительные настройки печати;
//  (выходные)
//   КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы
//   ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                             представление - имя области в которой был выведен объект;
//   ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ВедомостьУчетаВыдачиСИЗ") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,	"ПФ_MXL_ВедомостьУчетаВыдачиСИЗ",
			НСтр("ru = 'Ведомость учета выдачи СИЗ'"), ПечатьВыдачиСИЗ(МассивОбъектов, ОбъектыПечати), ,
			"Документ.ВыдачаСИЗ.ПФ_MXL_ВедомостьУчетаВыдачиСИЗ");
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьВыдачиСИЗ(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВыдачаСИЗ_РабочиеМеста";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ВыдачаСИЗ.ПФ_MXL_ВедомостьУчетаВыдачиСИЗ");
	
	ДанныеДляПечати = ДанныеПечатиДокументов(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	Для Каждого ОписаниеДокумента Из ДанныеДляПечати Цикл
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		// Формируем печатную форму выдачи.
		Результат = Новый ТабличныйДокумент;
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(ОписаниеДокумента);
		Результат.Вывести(ОбластьМакета);
		ТаблицаСИЗ = ОписаниеДокумента.ТаблицаСИЗ;
		СотрудникСИЗ = Неопределено;
		Для Каждого СтрокаСИЗ Из ТаблицаСИЗ Цикл
			Если СтрокаСИЗ.ФизическоеЛицо <> СотрудникСИЗ Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			Иначе
				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаОбъединенная");
			КонецЕсли;
			СотрудникСИЗ = СтрокаСИЗ.ФизическоеЛицо;
			ОбластьМакета.Параметры.Заполнить(ОписаниеДокумента);
			ОбластьМакета.Параметры.Заполнить(СтрокаСИЗ);
			Результат.Вывести(ОбластьМакета);
		КонецЦикла;
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ОбластьМакета.Параметры.Заполнить(ОписаниеДокумента);
		Результат.Вывести(ОбластьМакета);
		ТабличныйДокумент.Вывести(Результат);
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ОписаниеДокумента.ДокументСсылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ДанныеПечатиДокументов(МассивОбъектов)
	
	ДанныеПечатиОбъектов = Новый Массив;
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыдачаРабочиеМеста.Ссылка КАК Ссылка,
		|	ВыдачаРабочиеМеста.Ссылка.Организация КАК Организация,
		|	ВыдачаРабочиеМеста.РабочееМесто,
		|	ВыдачаРабочиеМеста.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВыдачаРабочиеМеста.ИдентификаторСтрокиРабочегоМеста КАК ИдентификаторСтрокиРабочегоМеста,
		|	ВыдачаРабочиеМеста.НомерСтроки
		|ПОМЕСТИТЬ ВТВыдачаРабочиеМеста
		|ИЗ
		|	Документ.ВыдачаСИЗ.РабочиеМеста КАК ВыдачаРабочиеМеста
		|ГДЕ
		|	ВыдачаРабочиеМеста.Ссылка В (&МассивОбъектов)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка,
		|	ИдентификаторСтрокиРабочегоМеста,
		|	ФизическоеЛицо";
	Запрос.Выполнить();
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВыдачаРабочиеМеста.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	ВТВыдачаРабочиеМеста КАК ВыдачаРабочиеМеста
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВыдачаРабочиеМеста.Организация КАК Организация
		|ИЗ
		|	ВТВыдачаРабочиеМеста КАК ВыдачаРабочиеМеста";
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	МаксимальныйИндекс = РезультатыЗапроса.ВГраница();
	
	ВыборкаСИЗ = РезультатыЗапроса[МаксимальныйИндекс].Выбрать();
	ВыборкаДокументов = РезультатыЗапроса[МаксимальныйИндекс - 1].Выбрать();
	
	СписокФизическихЛиц = РезультатыЗапроса[МаксимальныйИндекс - 1].Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо");
	Организации = РезультатыЗапроса[МаксимальныйИндекс].Выгрузить().ВыгрузитьКолонку("Организация");
	КадровыйУчет.СоздатьВТОсновныеСотрудникиФизическихЛиц(
		Запрос.МенеджерВременныхТаблиц, Истина, СписокФизическихЛиц, Организации, ТекущаяДатаСеанса()); 
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Выдача.Ссылка КАК ДокументСсылка,
		|	Выдача.Номер,
		|	Выдача.Дата,
		|	Выдача.Организация,
		|	Выдача.Подразделение,
		|	Организации.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
		|	Выдача.Ответственный КАК Ответственный,
		|	ВЫБОР
		|		КОГДА ИСТИНА В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				ИСТИНА
		|			ИЗ
		|				Документ.ВыдачаСИЗ.НоменклатураСИЗ КАК ПереченьСИЗ
		|			ГДЕ
		|				ПереченьСИЗ.Ссылка = Выдача.Ссылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьСИЗ
		|ИЗ
		|	Документ.ВыдачаСИЗ КАК Выдача
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО Выдача.Организация = Организации.Ссылка
		|ГДЕ
		|	Выдача.Ссылка В (&МассивОбъектов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыдачаРабочиеМеста.Ссылка КАК ДокументСсылка,
		|	ВыдачаРабочиеМеста.РабочееМесто,
		|	ВыдачаРабочиеМеста.ФизическоеЛицо,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(ОсновныеСотрудникиФизическихЛиц.Сотрудник КАК Справочник.Сотрудники).Код, """") КАК ТабельныйНомер,
		|	ВыдачаСИЗ.СИЗ КАК СИЗ,
		|	ВыдачаСИЗ.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВыдачаСИЗ.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
		|	ВыдачаСИЗ.Номенклатура КАК Номенклатура,
		|	ВыдачаСИЗ.Номенклатура.Артикул КАК НоменклатураАртикул,
		|	ВыдачаСИЗ.Размер КАК Размер,
		|	ВыдачаСИЗ.Количество КАК Количество,
		|	ВыдачаСИЗ.НомерСтроки КАК НомерСтрокиСИЗ,
		|	ВыдачаРабочиеМеста.НомерСтроки КАК НомерСтроки,
		|	СредстваИндивидуальнойЗащиты.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	СредстваИндивидуальнойЗащиты.ЕдиницаПериодичностиВыдачи КАК ЕдиницаПериодичностиВыдачи,
		|	СредстваИндивидуальнойЗащиты.КратностьВыдачи КАК КратностьВыдачи,
		|	СредстваИндивидуальнойЗащиты.СпособВыдачи КАК СпособВыдачи
		|ИЗ
		|	ВТВыдачаРабочиеМеста КАК ВыдачаРабочиеМеста
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыдачаСИЗ.НоменклатураСИЗ КАК ВыдачаСИЗ
		|		ПО ВыдачаРабочиеМеста.Ссылка = ВыдачаСИЗ.Ссылка
		|		И ВыдачаРабочиеМеста.ИдентификаторСтрокиРабочегоМеста = ВыдачаСИЗ.ИдентификаторСтрокиРабочегоМеста
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СредстваИндивидуальнойЗащиты КАК СредстваИндивидуальнойЗащиты
		|		ПО ВыдачаСИЗ.СИЗ = СредстваИндивидуальнойЗащиты.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОсновныеСотрудникиФизическихЛиц КАК ОсновныеСотрудникиФизическихЛиц
		|		ПО ВыдачаРабочиеМеста.ФизическоеЛицо = ОсновныеСотрудникиФизическихЛиц.ФизическоеЛицо
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументСсылка,
		|	НомерСтроки,
		|	НомерСтрокиСИЗ";
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	МаксимальныйИндекс = РезультатыЗапроса.ВГраница();
	
	ВыборкаСИЗ = РезультатыЗапроса[МаксимальныйИндекс].Выбрать();
	ВыборкаДокументов = РезультатыЗапроса[МаксимальныйИндекс - 1].Выбрать();
	Пока ВыборкаДокументов.Следующий() Цикл
		Описание = ОписаниеДляПечати();
		ЗаполнитьОписание(Описание, ВыборкаДокументов, ВыборкаСИЗ);
		ДанныеПечатиОбъектов.Добавить(Описание);
	КонецЦикла;
	
	Возврат ДанныеПечатиОбъектов;
	
КонецФункции

Функция ОписаниеДляПечати()
	
	Описание = Новый Структура;
	Описание.Вставить("ДокументСсылка");
	Описание.Вставить("Дата");
	Описание.Вставить("Номер");
	Описание.Вставить("ОрганизацияНаименованиеПолное");
	Описание.Вставить("ПодразделениеПредставление");
	Описание.Вставить("ОКПО");
	Описание.Вставить("ОКВЭД2");
	Описание.Вставить("ТаблицаСИЗ");
	Описание.Вставить("Ответственный");
	
	ТаблицаСИЗ = Новый ТаблицаЗначений;
	ТаблицаСИЗ.Колонки.Добавить("ДокументСсылка", Новый ОписаниеТипов("ДокументСсылка.ВыдачаСИЗ"));
	ТаблицаСИЗ.Колонки.Добавить("НомерСтрокиСИЗ", Новый ОписаниеТипов("Число"));
	ТаблицаСИЗ.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТаблицаСИЗ.Колонки.Добавить("ТабельныйНомер", Новый ОписаниеТипов("Строка"));
	ТаблицаСИЗ.Колонки.Добавить("СИЗ", Новый ОписаниеТипов("СправочникСсылка.СредстваИндивидуальнойЗащиты"));
	ТаблицаСИЗ.Колонки.Добавить("Размер", Новый ОписаниеТипов("СправочникСсылка.Размеры,Число"));
	ТаблицаСИЗ.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	ТаблицаСИЗ.Колонки.Добавить("ЕдиницаИзмеренияКод", Новый ОписаниеТипов("Строка"));
	ТаблицаСИЗ.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаСИЗ.Колонки.Добавить("НоменклатураАртикул", Новый ОписаниеТипов("Строка"));
	ТаблицаСИЗ.Колонки.Добавить("СрокСлужбы", Новый ОписаниеТипов("Строка"));
	ТаблицаСИЗ.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	ТаблицаСИЗ.Колонки.Добавить("ПериодичностьВыдачи", Новый ОписаниеТипов("Число"));
	ТаблицаСИЗ.Колонки.Добавить("ЕдиницаПериодичностиВыдачи", Новый ОписаниеТипов("ПеречислениеСсылка.Периодичность"));
	ТаблицаСИЗ.Колонки.Добавить("КратностьВыдачи", Новый ОписаниеТипов("Число"));
	ТаблицаСИЗ.Колонки.Добавить("СпособВыдачи", Новый ОписаниеТипов("ПеречислениеСсылка.СпособыВыдачиСИЗ"));
	
	Описание.ТаблицаСИЗ = ТаблицаСИЗ;
	
	Возврат Описание;
	
КонецФункции

Процедура ЗаполнитьОписание(Описание, ВыборкаДокументов, ВыборкаСИЗ)
	
	ЗаполнитьЗначенияСвойств(Описание, ВыборкаДокументов);
	
	Описание.Дата = Формат(ВыборкаДокументов.Дата, "ДЛФ=D");
	Описание.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаДокументов.Номер);
	Описание.ПодразделениеПредставление = Строка(ВыборкаДокументов.Подразделение);
	ЗаполнитьРеквизитыОрганизации(ВыборкаДокументов.Организация, Описание);
	
	Если ВыборкаДокументов.ЕстьСИЗ Тогда
		Пока ВыборкаСИЗ.НайтиСледующий(ВыборкаДокументов.ДокументСсылка, "ДокументСсылка") Цикл
			НоваяСтрока = Описание.ТаблицаСИЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаСИЗ);
			НоваяСтрока.ТабельныйНомер =
				ПрефиксацияОбъектовКлиентСервер.УдалитьПрефиксыИзНомераОбъекта(ВыборкаСИЗ.ТабельныйНомер, Истина, Истина);
			НоваяСтрока.СрокСлужбы = ТекстСрокаСлужбы(
				ВыборкаСИЗ.СпособВыдачи,
				ВыборкаСИЗ.КратностьВыдачи,
				ВыборкаСИЗ.ПериодичностьВыдачи,
				ВыборкаСИЗ.ЕдиницаПериодичностиВыдачи);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыОрганизации(Организация, Описание)
	
	ИменаПолей =
	"ОКПО,
	|ОКВЭД2";
	
	УстановитьПривилегированныйРежим(Истина);
	СведенияОрганизации = ЗарплатаКадры.СведенияОбОрганизации(Организация, ИменаПолей);
	УстановитьПривилегированныйРежим(Ложь);
	
	ЗаполнитьЗначенияСвойств(Описание, СведенияОрганизации);
	
КонецПроцедуры

Функция ФизическиеЛицаРабочиеМестаВыдачи(Ссылка) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыдачаРабочиеМеста.РабочееМесто КАК РабочееМесто,
		|	ВыдачаРабочиеМеста.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВыдачаСИЗ.СИЗ КАК СИЗ
		|ИЗ
		|	Документ.ВыдачаСИЗ.РабочиеМеста КАК ВыдачаРабочиеМеста
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыдачаСИЗ.НоменклатураСИЗ КАК ВыдачаСИЗ
		|		ПО (ВыдачаРабочиеМеста.Ссылка = &Ссылка)
		|			И ВыдачаРабочиеМеста.Ссылка = ВыдачаСИЗ.Ссылка
		|			И ВыдачаРабочиеМеста.ИдентификаторСтрокиРабочегоМеста = ВыдачаСИЗ.ИдентификаторСтрокиРабочегоМеста
		|ГДЕ
		|	ВыдачаРабочиеМеста.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизическоеЛицо,
		|	РабочееМесто";
	
	ДанныеСИЗ = Новый Массив;
	
	Обход = Обработки.ОбходКоллекции.НовыйОбход(Запрос.Выполнить().Выгрузить());
	Пока Обход.СледующийПоЗначениюПоля("ФизическоеЛицо") Цикл
		Пока Обход.СледующийПоЗначениюПоля("РабочееМесто") Цикл
			Описание = ОписаниеСтрокиВыдачиСИЗ();
			ЗаполнитьЗначенияСвойств(Описание, Обход.ТекущиеДанные());
			Пока Обход.Следующий() Цикл
				Описание.ОтмеченныеСИЗ.Добавить(Обход.ТекущиеДанные().СИЗ);
			КонецЦикла;
			ДанныеСИЗ.Добавить(Описание);
		КонецЦикла;
	КонецЦикла;
	
	Возврат ДанныеСИЗ;
	
КонецФункции

Функция ОписаниеСтрокиВыдачиСИЗ()
	
	Описание = Новый Структура;
	Описание.Вставить("ФизическоеЛицо");
	Описание.Вставить("РабочееМесто");
	Описание.Вставить("ОтмеченныеСИЗ", Новый Массив);
	
	Возврат Описание;
	
КонецФункции

Функция ТекстСрокаСлужбы(СпособВыдачи, Кратность, Периодичность, ЕдиницаПериодичности)
	Если СпособВыдачи = Перечисления.СпособыВыдачиСИЗ.ДоИзноса Тогда
		Возврат НСтр("ru = 'До износа'");
	КонецЕсли;
	Если Кратность = 0 Или Периодичность = 0 Тогда
		Возврат "";
	КонецЕсли;
	СрокСлужбыВМесяцах = СредстваИндивидуальнойЗащиты.ИнтервалМесяцев(ЕдиницаПериодичности, Периодичность, Кратность);
	Если СрокСлужбыВМесяцах = 0 Тогда
		Возврат "";
	КонецЕсли;
	Возврат СтрШаблон(НСтр("ru = '%1 мес.'"), СрокСлужбыВМесяцах);
КонецФункции

#КонецОбласти

Функция ОписаниеПодписейДокумента() Экспорт 
	
	ОписаниеПодписей = ПодписиДокументов.ОписаниеТаблицыПодписей();
	
	ПодписиДокументов.ДобавитьОписаниеПодписейОрганизации(ОписаниеПодписей, "Руководитель, ОтветственныйЗаОхрануТруда");
	
	Возврат ОписаниеПодписей;
		
КонецФункции

#КонецОбласти

#КонецЕсли
